In [5]:
import pandas as pd

In [2]:
Colours = pd.Series(["Red", "Green", "Blue"])

In [3]:
Colours

0      Red
1    Green
2     Blue
dtype: object

In [9]:
Car = pd.Series (["Pickup", "Suv", "Truck"])

In [10]:
Car

0    Pickup
1       Suv
2     Truck
dtype: object

In [15]:
mydataframe = pd.DataFrame({"Brand": Car, "Colour": Colours })
mydataframe

    Brand Colour
0  Pickup    Red
1     Suv  Green
2   Truck   Blue

In [20]:
carsalesdataframe = pd.read_csv("car-sales.csv")
carsalesdataframe

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [21]:
mydataframe.to_csv("exported-mydataframe", index = False)

In [22]:
mydataframe.describe()

       Brand Colour
count      3      3
unique     3      3
top      Suv  Green
freq       1      1

In [23]:
mydataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Brand   3 non-null      object
 1   Colour  3 non-null      object
dtypes: object(2)
memory usage: 176.0+ bytes

In [24]:
# It shows theres 2 collmuns and 3 entries, and that theres 2 objects as well as memory usage

In [27]:
numbers = pd.Series([1, 2 , 3])

In [28]:
numbers

0    1
1    2
2    3
dtype: int64

In [29]:
numbers.mean()

2.0

In [32]:
numbers.sum()

6

In [33]:
len(carsalesdataframe)

10

In [34]:
list(carsalesdataframe)

['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price']

In [40]:
carsalesdataframe.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [41]:
carsalesdataframe.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [42]:
carsalesdataframe.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [44]:
carsalesdataframe.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [45]:
carsalesdataframe.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [46]:
carsalesdataframe

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [49]:
carsalesdataframe["Odometer (KM)"]

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [52]:
carsalesdataframe["Odometer (KM)"].mean()

78601.4

In [53]:
carsalesdataframe["Odometer (KM)"] > 100000

0     True
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9    False
Name: Odometer (KM), dtype: bool